[
    {
        "img": 
        {
            "img":      "k_kit02_egao"
        },
        "dialogue": "Hi there! This is a short into into the FLOOR editor. I hope this is informative for you!",
        "dir": "GR-Portrait"
    },
    {
        "img": 
        {
            "img":      "k_kit02_egao"
        },
        "dialogue": "Lets start with recapping quickly how SCUFF does it's rendering. "
    },
    {
        "img": 
        {
            "img":      "k_kit02_tujyo"
        },
        "dialogue": "SCUFF starts off with a giant .json file which contains every bit of data required to render a fancy page. <br>This includes, but is not limited to; <br>images<br>items<br>text<br>speech arrow"
    },
    {
        "img": 
        {
            "img":      "k_kit02_tujyo"
        },
        "dialogue": "Furthermore, the first entry contains more data, such as where the directory for the images are located."
    },
    {
        "img": 
        {
            "img":      "k_kit02_egao"
        },
        "dialogue": "When everything is done correctly, the .json translates into these beatiful pages!"
    },
    {
        "img": 
        {
            "img":      "k_kit02_konwaku"
        },
        "dialogue": "But there's a small issue... altough it's not very difficult to make those .json files, it takes wayyyy too long!"
    },
    {
        "img": 
        {
            "img":      "k_kit02_egao"
        },
        "dialogue": "This is where a level editor comes in!"
    },
    {
        "img": 
        {
            "img":      "k_kit02_tujyo"
        },
        "dialogue": "To put it simply, a 'level editor' is nothing more than a piece of software that helps with creating maps and levels in games."
    },
    {
        "img": 
        {
            "img":      "k_kit02_tujyo"
        },
        "dialogue": "An example of that, would be the Hammer editor by Valve for Source games. <br><br> All of the maps and world made for all the games made by Valve, are made with the Hammer editor. This way, a developer can visaully see real time what their world will look like in game, without needing to manually creating a file containing this data"
    },    {
        "img": 
        {
            "img":      "k_kit02_egao"
        },
        "dialogue": "With this, Hammer is to Source what FLOOR is for SCUFF: an easy and intuitive way to create a 'map' for the game engine"
    },
    {
        "img": 
        {
            "img":      "k_kit02_egao"
        },
        "dialogue": "You can find the FLOOR editor in the homepage for games"
    }
]